Repository: seanf/jbosstools-l10n
Catalog: po/*/*.po
Languages: as

# description
source: Provides a WTP adapter for JBoss AS 4.x and 5.x. Supports incremental and exploded deployment.
as: JBoss AS 4.x と 5.x 用の WTP アダプターを提供します。差分デプロイと展開型デプロイをサポートします。

# Bundle-Name.0
source: Project Archives Webtools Integration Plug-in
as: プロジェクト・アーカイブ Webtools 連携プラグイン

# nodeContribution.label.publishToServer
source: Publish To Server
as: サーバーへ公開

# nodeContribution.label.editPublishSettings
source: Edit publish settings...
as: 公開設定の編集...

# ExceptionCannotScanDirectory
source: Cannot scan directory
as: ディレクトリーをスキャンできません

# ExceptionUnexpectedException
source: Unexpected exception
as: 予期しない例外

# ExceptionCannotDeployFile
source: Cannot publish file {0}
as: ファイル {0} を公開できません

# ErrorDuringPublish
source: Error publishing module {0}
as: モジュール {0} の公開中にエラー

# PublishSuccessful
source: Module {0} published.
as: モジュール {0} は公開されました。

source: Archive Publish Settings
as: アーカイブ公開設定

source: Select Server Wizard
as: サーバー・ウィザードの選択

# SelectServerWizardDescription
source: Select the server to publish the archive to.
as: アーカイブを公開するサーバーの選択。

# SelectServerWizardTitle
source: Publish archive to a server
as: アーカイブをサーバーに公開

source: Always publish to these servers
as: 常にこれらのサーバーに公開

# AutoDeployAfterBuild
source: Auto-deploy to selected servers after builds
as: ビルド後に選択したサーバーに自動デプロイ

source: Delete Files?
as: ファイルを削除しますか?

# DeleteFilesMessage
source: Are you sure you want to delete the selected files?
as: 選択したファイルを本当に削除しますか?

# FilesetsCreateFilter
source: Create File Filter
as: フィルター・ファイルの作成

# FilesetsDeleteFilter
source: Delete File Filter
as: フィルター・ファイルの削除

# FilesetsEditFilter
source: Edit File Filter
as: フィルター・ファイルの編集

# FilesetsDeleteFile
source: Delete File
as: ファイルの削除

# FilesetsEditFile
source: Edit File
as: ファイルを編集する

# FilesetsNewFileset
source: New File Filter
as: 新規フィルター・ファイル

# FilesetsNewName
source: Name:
as: 名前:

# FilesetsNewRootDir
source: Root Directory:
as: ルート・ディレクトリー:

# FilesetsNewBrowse
source: Browse...
as: 参照...

# FilesetsNewIncludes
source: Includes:
as: 含む:

# FilesetsNewExcludes
source: Excludes:
as: 除外:

# FilesetsNewPreview
source: Preview
as: プレビュー

# FilesetsCannotOpenFile
source: Cannot open file
as: ファイルを開くことができません

# FilesetsDialogTitle
source: File filter
as: ファイル・フィルター

# FilesetsDialogMessage
source: Creates a new file filter
as: 新規ファイル・フィルターを作成します

source: New EAR
as: 新規 EAR

source: EAR Preview
as: EAR プレビュー

# EarDescription
source: Preview the EAR Later, you can customize this structure further.
as: EAR をプレビューしください 後でこの構造をさらにカスタマイズすることができます。

source: New WAR
as: 新規 WAR

source: WAR Preview
as: WAR プレビュー

# WarDescription
source: Preview the WAR Later, you can customize this structure further.
as: WAR をプレビューしください 後でこの構造をさらにカスタマイズすることができます。

source: New EJB JAR
as: 新規 EAR JAR

source: Preview
as: プレビュー

source: Build Archive
as: アーカイブのビルド

source: EJB JAR Preview
as: EJB JAR プレビュー

# EjbJarDescription
source: Preview the EJB JAR Later, you can customize this structure further.
as: EJB JAR をプレビューしください 後でこの構造をさらにカスタマイズすることができます。

# Bundle-Name.0
source: JBoss AS Classpath Core Plug-in
as: JBoss AS クラスパス・コア・プラグイン

# Bundle-Name.0
source: JBoss AS Classpath Ui Plug-in
as: JBoss AS クラスパス UI プラグイン

# jeeClasspathDescription
source: These libraries include the API and Source for the chosen JEE version.
as: これらのライブラリーは選択した JEE バージョンの API とソースを含みます。

# ejb3ClasspathPageTitle
source: JBoss EJB 3.0 Libraries
as: JBoss EJB 3.0 ライブラリー

# ejb3ClasspathPageDescription
source: Add EJB 3.0 Libraries from one of the declared servers.
as: 宣言されたサーバーの１つから EJB 3.0 ライブラリーを追加。

# runModeNotSupported
source: Selected VM does not support this mode
as: 選択された VM はこのモードをサポートしません

# pluginName
source: JBoss WTP Server Tools Core Plugin
as: JBoss WTP サーバー Tools コア・プラグイン

# enterpriseProviderName
source: JBoss Enterprise Middleware
as: JBoss エンタープライズ・ミドルウェア

# jboss.version.32.description
source: JBoss Application Server 3.2
as: JBoss アプリケーション・サーバー 3.2

# jboss.version.40.description
source: JBoss Application Server 4.0
as: JBoss アプリケーション・サーバー 4.0

# jboss.version.42.description
source: JBoss Application Server 4.2
as: JBoss アプリケーション・サーバー 4.2

# jboss.version.50.description
source: JBoss Application Server 5.0
as: JBoss アプリケーション・サーバー 5.0

# jboss.eap.version.43.name
source: JBoss Enterprise Application Platform 4.3
as: JBoss エンタープライズ・アプリケーション・プラットフォーム 4.3

# jboss.eap.version.43.description
source: JBoss Enterprise Application Platform (EAP) 4.3
as: JBoss エンタープライズ・アプリケーション・プラットフォーム (EAP) 4.3

# deploy.runtime.description
source: A runtime provided to allow a deploy-only server the ability to deploy certain project types.
as: このランタイムは特定のプロジェクト・タイプをデプロイするためにデプロイのみを許可するサーバーを提供します。

# Bundle-Name.0
source: JBoss AS Core Plug-in
as: JBoss AS コア・プラグイン

# Bundle-Name.0
source: Mbeans Plug-in
as: MBeans プラグイン

source: New MBean Interface
as: 新規 MBean インターフェース

# NewMBeanInterfaceDesc
source: Create the interface for the MBean
as: MBean インターフェースの作成

# NewMBeanName
source: MBean Name
as: MBean 名

# NewMBeanInterfaceName
source: Interface Name
as: インターフェース名

source: New MBean Class
as: 新規 MBean クラス

# MBeanClassDescription
source: Create the concrete MBean Class
as: MBean コンクリート・クラスの作成

# MBeanServiceXML
source: Create -service.xml file?
as: 新規 -service.xml ファイルを作成しますか?

# ServiceXMLAddAttributeTags
source: Add missing attribute tags
as: 欠落している属性タグの追加

# NewSessionBeanWizardTitle
source: Session Bean Wizard
as: セッション Bean ウィザード

# NewSessionBeanWizardBeanTypeLabel
source: Session Bean Type:
as: セッション Bean 型:

# NewSessionBeanWizardStatefulButtonLabel
source: Stateful
as: ステートフル

# NewSessionBeanWizardStatelessButtonLabel
source: Stateless
as: ステートレス

# NewSessionBeanWizardBeanPackageLabel
source: Bean Package:
as: Bean パッケージ:

# NewSessionBeanWizardBeanNameLabel
source: Bean Name:
as: Bean 名:

# NewSessionBeanWizardBeanClassNameLabel
source: Bean Class Name:
as: Bean クラス名:

# NewSessionBeanWizardUseCustomInterfacePackageButtonLabel
source: Remote Interface Package:
as: リモート・インターフェース・パッケージ:

# NewSessionBeanWizardRemoteInterfaceNameLabel
source: Remote Interface Name:
as: リモート・インターフェース名:

# NewSessionBeanWizardMessage
source: Create a new EJB3 Session Bean
as: 新規 EJB3 セッション Bean の作成

# NewSessionBeanWizardDescription
source: Create a new EJB3 Session Bean
as: 新規 EJB3 セッション Bean の作成

# NewMessageBeanWizardMessage
source: Create a new Message-Driven Bean
as: 新規メッセージ駆動型 Bean の作成

# NewMessageBeanWizardDescription
source: Create a new Message-Driven Bean
as: 新規メッセージ駆動型 Bean の作成

source: Browse...
as: 参照...

source: Server Name
as: サーバー名

# wf_NameLabel
source: Name
as: 名前

# wf_HomeDirLabel
source: Home Directory
as: ホーム・ディレクトリー

# wf_ConfigLabel
source: Configuration
as: 構成

# rwf_Explanation
source: A JBoss Server runtime references a JBoss installation directory. It can be used to set up classpaths for projects which depend on this runtime, as well as by a "server" which will be able to start and stop instances of JBoss.
as: JBoss サーバー・ランタイムは JBoss インストール・ディレクトリーを参照します。 JBoss インスタンスを始動、停止ができる "サーバー" と同様に、このランタイムに 依存するプロジェクト用のクラスパスを設定するためにも使用されます。

# rwf_NameInUse
source: Runtime name already in use
as: ランタイム名は既に使用中

# rwf_nameTextBlank
source: The name field must not be blank
as: 名前は空欄にできません

# rwf_homeDirBlank
source: The directory field must not be blank
as: ディレクトリーは空欄にできません

# JBAS_version
source: JBoss Application Server {0}
as: JBoss アプリケーション・サーバー {0}

# JBEAP_version
source: JBoss Enterprise Application Platform {0}
as: JBoss エンタープライズ・アプリケーション・サーバー {0}

# swf_Title
source: Create a new JBoss Server
as: 新規 JBoss サーバーを作成します

# swf_RuntimeInformation
source: Runtime Information
as: ランタイム情報

# swf_Explanation
source: A JBoss Server manages starting and stopping instances of JBoss. It manages command line arguments and keeps track of which modules have been deployed.
as: JBoss サーバーは、JBoss インスタンスの開始および停止を管理します。 コマンドライン引数を管理しデプロイしたモジュールの状況を把握します。

# swf_Explanation2
source: If the runtime information below is incorrect, please press back, Installed Runtimes..., and then Add to create a new runtime from a different location.
as: 以下のランタイム情報が正しくない場合、戻るを押して、インストール済みのランタイム...、 異なるロケーションから新規ランタイムを作成し追加してください。

# swf_AuthorizationDescription
source: Set the login and password for your server. This will ensure it starts and stops properly.
as: サーバーのログイン名とパスワードを設定してください。 これにより適切に開始と停止が実行されたかを確認します。

# swf_AuthenticationGroup
source: Login Credentials
as: ログイン証明書

# swf_Username
source: User Name
as: ユーザー名

# swf_Password
source: Password
as: パスワード

# swf_NameInUse
source: Server name already in use
as: サーバー名は既に使用中

# swf_DeployEditorHeading
source: Deployment
as: デプロイメント

# swf_DeploymentDescription
source: The temporary deployment location is where files will be copied to before being renamed into the deploy directory. This folder should be on the same file system as the deploy folder.
as: 一時的なデプロイ・ディレクトリー・ロケーションは、デプロイ・ディレクトリーに 移動される前にファイルがコピーされる場所です。 このフォルダーはデプロイ・フォルダーと同一の ファイルシステムにあるべきです。

# swf_DeployDirectory
source: Deploy Directory
as: デプロイ・ディレクトリー

# swf_TempDeployDirectory
source: Temporary Deploy Directory
as: 一時的なデプロイ・ディレクトリー

# sswf_Title
source: Create a new System Copy Server
as: 新規システム複製サーバーを作成してください

# sswf_BaseName
source: Local Deployer
as: ローカル・デプロイヤー

# credentials_warning
source: Your server is responding to JMX inquiries with a Security Exception. You can try entering new credentials below, or you can double-click on your server and verify that the host, JNDI port, username, and password are accurate. You can also click "ignore" below to begin working with your server, but deploying to and stopping the server may not function properly.
as: サーバは、セキュリティ例外で JMX 問い合わせに応答しています。 以下に新しい証明書を入力することができます、あるいはサーバーをダブルクリックして、 ホストと JNDI ポート、ユーザー名、パスワードが正しいかを確認することができます。 以下の"無視"をクリックすることでサーバーを動作開始することはできますが、 サーバーにデプロイしたり、サーバーを停止したりするのは、適切に動作しないかもしれません。

# credentials_save
source: Save these credentials?
as: 証明書を保管しますか?

source: Property
as: プロパティー

source: Value
as: 値

# ServerDialogHeading
source: JBoss Server
as: JBoss サーバー

# DeleteModuleText
source: Remove
as: 除去

# FullPublishModuleText
source: Full Publish
as: 完全公開

# IncrementalPublishModuleText
source: Incremental Publish
as: 差分公開

# DeleteModuleDescription
source: Remove this module from the server.
as: このモジュールをサーバーから除去。

# PublishModuleDescription
source: Force a republish action on this module.
as: このモジュールを強制的に再公開。

# DeleteModuleConfirm
source: Are you sure you want to remove the module from the server?
as: サーバーからこのモジュールを削除しますか?

# ActionDelegateMakeDeployable
source: Make Deployable
as: デプロイします

# ActionDelegateMakeUndeployable
source: Make Undeployable
as: アンデプロイします

# ActionDelegateDeployableServersNotFoundTitle
source: No deployable servers found
as: デプロイ可能なサーバーが見つかりません

# ActionDelegateDeployableServersNotFoundDesc
source: There are no servers that support deploying single files.
as: 単一ファイルのデプロイをサポートするサーバーはありません。

# ActionDelegateCannotPublish
source: Cannot Publish To Server
as: サーバーに公開できません

# ActionDelegatePublishFailed
source: Publishing files to server failed
as: サーバーへファイルの公開を失敗しました

# ActionDelegateFileResourcesOnly
source: One or more selected objects are not Files.
as: 選択したオブジェクトの１つ以上がファイルではありません。

# ActionDelegateSelectServer
source: Select a server to publish to
as: 公開するサーバーを選択してください

# ConsoleResourceNotFound
source: Resource not found
as: リソースが見つかりません

# ConsoleCouldNotLocateInWorkspace
source: Could not locate {0} in workspace.
as: ワークスペースで {0} を捜し出せません。

source: Twiddle Dialog
as: Twiddle ダイアログ

# TwiddleDialogExecute
source: Execute Twiddle
as: Twiddle の実行

# TwiddleDialogDone
source: Done
as: 終了

# TwiddleDialogArguments
source: Twiddle Arguments:
as: Twiddle 引数:

# XPathNewCategory
source: New Category
as: 新規カテゴリー

# XPathNewCategoryNameInUse
source: Category Name In use.
as: カテゴリー名は使用中です。

# XPathCategoryName
source: Category Name
as: カテゴリー名

# XPathNewXpath
source: New XPath
as: 新規 XPath

# XPathNameEmpty
source: Name must be set.
as: 名前を設定する必要があります。

# XPathNameInUse
source: Name already in use.
as: 名前は既に使用中です。

# XPathColumnLocation
source: Location
as: ロケーション

# XPathColumnAttributeVals
source: Value
as: 値

# XPathName
source: Name:
as: 名前:

source: XPath Pattern:
as: XPath パターン:

# XPathAttribute
source: Attribute Name:
as: 属性名:

# DescriptorXPathRemoveCategory
source: Remove Category
as: カテゴリーの除去

# DescriptorXPathRemoveCategoryDesc
source: Are you sure you want to delete this category and all of its elements? All sub-nodes will be lost.
as: このカテゴリとすべての 要素を削除しますか? すべてのサブ・ノードは失われます。

# DescriptorXPathNewXPath
source: New XPath
as: 新規 XPath

# DescriptorXPathEditXPath
source: Edit XPath
as: XPath の編集

# DescriptorXPathDeleteXPath
source: Delete XPath
as: XPath の削除

# DescriptorXPathMatch
source: Match
as: 一致

# EditorUseWorkspaceMetadata
source: Use workspace metadata (does not modify JBoss deploy folder)
as: ワークスペース・メタ・データの使用 (JBoss デプロイ・フォルダーは修正されません)

# EditorUseServersDeployFolder
source: Use the JBoss deploy folder
as: JBoss デプロイ・フォルダーを使用してください

# EditorUseCustomDeployFolder
source: Use a custom deploy folder
as: カスタム・デプロイ・フォルダーを使用してください

# EditorSetDeployLabel
source: Set Deploy Directory
as: デプロイ・ディレクトリーの設定

# EditorSetTempDeployLabel
source: Set Temporary Deploy Directory
as: 一時的なデプロイ・ディレクトリーの設定

# EditorSetRadioClicked
source: Set Deploy Location
as: デプロイ・ロケーションの設定

# EditorDeployDNE
source: The deploy directory "{0}" does not exist.
as: デプロイ・ディレクトリー "{0}" は存在しません。

# EditorTempDeployDNE
source: The temporary deploy directory "{0}" does not exist.
as: 一時的なデプロイ・ディレクトリー "{0}" は存在しません。

# EditorStartupPollerLabel
source: Startup Poller
as: スタートアップ監視

# EditorShutdownPollerLabel
source: Shutdown Poller
as: シャットダウン監視

# EditorChangeStartPollerCommandName
source: Change Startup Poller
as: スタートアップ監視の変更

# EditorChangeStopPollerCommandName
source: Change Shutdown Poller
as: シャットダウン監視の変更

# EditorServerPorts
source: Server Ports
as: サーバー・ポート

# EditorServerPortsDescription
source: The ports entered here are which ports the tools will poll the server on. Changing these fields will not change the ports the server itself listens on.
as: ここで入力したポートは、ツールが サーバーを監視するポートです。この項目の変更は サーバー自体がリッスンするポートを変更しません。

# EditorJNDIPort
source: JNDI Port
as: JNDI ポート

# EditorWebPort
source: Web Port
as: Web ポート

# EditorAutomaticallyDetectPort
source: Automatically detect
as: 自動検出

# EditorPortInvalid
source: One or more ports have an invalid value. This may adversely affect the tooling's ability to interact with the server.
as: １つ以上のポートが、無効な値を持っています。これはサーバーと連係動作するツールの機能に悪影響を与えるかもしれません。

# EditorChangeJNDICommandName
source: Change JNDI Port Details
as: JNDI ポートの詳細の変更

# EditorChangeWebCommandName
source: Change Web Port Details
as: Web ポートの詳細の変更

# EditorChangeUsernameCommandName
source: Change Username
as: ユーザー名の変更

# EditorChangePasswordCommandName
source: Change Password
as: パスワードの変更

# EditorCPD_Value
source: Current Value
as: 現在値

# EditorCPD_DefaultShellTitle
source: Edit Port
as: ポートの編集

# EditorCPD_DefaultDescription
source: This wizard allows you to edit which xpath is used to locate a port used by the tooling. This will not change any server files, only what ports are used to interact with it.
as: このウィザードで、ツールによって使用されるポートを設定する XPath の編集ができます。 これはサーバーのファイルを変更しません、サーバーと通信するポート設定するだけです。

# EditorCPD_RestoreDefault
source: Restore Default
as: デフォルトの復元

source: Configure...
as: 構成...

source: Server save failed
as: サーバーの保管を失敗しました

# LaunchInvalidConfigChanged
source: Configuration can only be changed by modifying the server's runtime.
as: 構成はサーバー・ランタイムを修正することのみにより変更できます。

# LaunchInvalidHostChanged
source: The Host can only be changed in the Server Editor.
as: ホストはサーバー・エディターでのみ変更できます。

# START_IN_DEBUG_MODE
source: Start {0} in debug mode
as: {0} をデバッグ・モードで始動

# RESTART_IN_DEBUG_MODE
source: Restart {0} in debug mode
as: {0} をデバッグ・モードで再始動

# START_IN_RUN_MODE
source: Start {0}
as: {0} を始動

# RESTART_IN_RUN_MODE
source: Restart {0}
as: {0} を再始動

# SELECT_A_SERVER
source: Select a default server
as: デフォルト・サーバーを選択してください

# STOP_SERVER
source: Shutdown {0}
as: {0} を停止

# CHANGE_TIME_STAMP
source: Change Timestamp of {0}
as: {0} のタイムスタンプの変更

# CHANGE_TIME_STAMP_DEFAULT
source: Touch descriptors
as: タイムスタンプの変更

# pluginName
source: JBoss WTP Server Tools UI Plugin
as: JBoss WTP サーバー Tools UI プラグイン

# jbossLaunchconfigurationTabGroupDescription
source: Below is the launch configuration properties for starting JBoss Servers
as: 以下は JBoss サーバー始動の起動構成プロパティーです

# actionSets.modelActions.label
source: JBoss Tools Run Actions
as: JBoss Tools 実行アクション

# actionSets.modelActions.description
source: Description For JBoss Tools Model Actions
as: JBoss Tools WTP モデル・アクションの説明

# actionSets.projectActions.saveModel.label
source: Save Model
as: モデルの保管

# actionSets.serverActions.selectServer.label
source: JBoss Tools WTP Server Actions
as: JBoss Tools WTP サーバー・アクション

# actionSets.serverActions.label
source: JBoss Tools WTP Server Actions
as: JBoss Tools WTP サーバー・アクション

# actionSets.serverActions.description
source: Description for JBoss Tools WTP Server Actions
as: JBoss Tools WTP サーバー・アクションの説明

# actionSets.serverActions.changeWebXmlTimeStamp.label
source: Touch descriptors
as: タイムスタンプの変更

# actionSets.serverActions.restartServer.label
source: Restart Server
as: サーバーの再始動

# actionSets.serverActions.stopServer.label
source: Stop Server
as: サーバーの停止

# actionSets.serverActions.debugServer.label
source: Start Server in Debug Mode
as: デバッグ・モードでサーバーを再始動

# actionSets.serverActions.startServer.label
source: Start Server
as: サーバーの始動

# actionSets.serverActions.runApplicationFromSelectedElement.label
source: Run Application from Selected Element
as: 選択された要素からアプリケーションを実行

# ViewName_JBossServerView
source: JBoss Server View
as: JBoss サーバー・ビュー

# ViewName_ServerLog
source: Server Log
as: Server ログ
